#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.deployer: Refreshing state... [id=deployer-key-ec2]
aws_security_group.ec2_SG: Refreshing state... [id=sg-058292d9e4ae38580]
aws_instance.ec2_instance: Refreshing state... [id=i-08b913d1aff9e8b36]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.ec2_instance has been deleted
  - resource "aws_instance" "ec2_instance" {
      - id                                   = "i-08b913d1aff9e8b36" -> null
        tags                                 = {
            "Name"         = "HybridHavenAPI"
            "createdusing" = "Terraform"
            "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
        # (33 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_key_pair.deployer has been deleted
  - resource "aws_key_pair" "deployer" {
        id          = "deployer-key-ec2"
      - key_name    = "deployer-key-ec2" -> null
        tags        = {
            "createdusing" = "Terraform"
            "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.ec2_SG has been deleted
  - resource "aws_security_group" "ec2_SG" {
      - id                     = "sg-058292d9e4ae38580" -> null
        name                   = "ec2_SG"
        tags                   = {
            "createdusing" = "Terraform"
            "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.ec2_instance will be created
  + resource "aws_instance" "ec2_instance" {
      + ami                                  = "ami-0fc3317b37c1269d3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "deployer-key-ec2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"         = "HybridHavenAPI"
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tags_all                             = {
          + "Name"         = "HybridHavenAPI"
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ff65e0395b6df4153bb51f27a69f45d6e2cbf05e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.deployer will be created
  + resource "aws_key_pair" "deployer" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "deployer-key-ec2"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAXpCkSNl19FhToQl+worTQeY38tMBx9jkvhgqV6vZkwQR28jTreVS09k9qS8sqMtlQuuHE5BXwBk76LvwTofPJingd7AnVK6I9iaEyHykEU3t7ZFjim+O5kfBw3g56xDWSTV8qD1mWeNul0mDPmZuRe/eDq/7QuQg/M+aGtoINy9hELr8y8OVXJTxsCN16NpGECf+QXbB4pOiugCLQBRf8kg06qZ5oE0rD/MD7gVvN9qO7pjyMlH1hGpiRwMEXeRLiHf0mU2Tl/e2qdEIQfSnwknE/BiVBDPd2EnB4tjr1qzlZSU5+0RBu/Nr63S1Vv16Xee6b3krI5pHZd5pcvpXBWFqyaJ7612dtNu+t5HjchCPtDXM5AHGa8xAF9bjNbaalPTY38ilpnzqUVsupUlW8BLdlnAlEnyCJKWarfEY4rD5PdwkNoLK+xkKFovgOVJgIdajQipl34xnEuN8p9gk0Lo08SwxIqad2ao1SBVmO5mjaMTHUM3lem/iqO7FXfs= ec2-user"
      + tags            = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tags_all        = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
    }

  # aws_security_group.ec2_SG will be created
  + resource "aws_security_group" "ec2_SG" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "ec2_SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tags_all               = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_instance_id = "i-08b913d1aff9e8b36" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Umang-Vadadoriya-BBD, Action: `pull_request`*